math/pde/basics.org
#+TITLE: Partial Differential Equations
#+AUTHOR: Alex Nelson
#+EMAIL: pqnelson@gmail.com
#+LANGUAGE: en
#+OPTIONS: H:5
#+HTML_DOCTYPE: html5
# Created Saturday December 12, 2020 at 10:45AM
#+INCLUDE: ../../org-macros.org
#+HTML_LINK_UP: ./index.html
#+HTML_LINK_HOME: ../index.html
#+HTML_HEAD_EXTRA: <link rel="stylesheet" type="text/css" href="../css/stylesheet.css" />

* Introduction

#+begin_remark
The fundamental difference between partial differential equations
and ordinary differential equations is the number of variables
we're working with. For ODEs, we're usually working with functions
of time (or some other single parameter). Partial differential
equations use multiple independent variables (e.g., functions of
space and time).

One strategy to solve problems like

\begin{equation}
\sum^{n}_{\mu=0}a^{\mu}\partial_{\mu}f = 0
\end{equation}

is to rewrite this using a "linear operator"

\begin{equation}
\sum^{n}_{\mu=0}a^{\mu}\partial_{\mu} = L
\end{equation}

then our problem becomes

\begin{equation}
L(f) = 0.
\end{equation}

This amounts to finding the kernel of $L$.
#+end_remark

#+begin_proposition
Recall an operator $L$ is linear if, for arbitrary constants
$c_{1}$ and $c_{2}$, we have

\begin{equation}
L(c_{1}\mu_{1} + c_{2}\mu_{2}) = c_{1}L(\mu_{1}) + c_{2}L(\mu_{2}).
\end{equation}
#+end_proposition

#+NAME: ex:linear-operator:transport-equation
#+begin_math-example
The {{{define(transport equation)}}} in 2-dimensions looks like

\begin{equation}
(\partial_{x} + \partial_{y})\mu(x,y) = 0.
\end{equation}

This is indeed a linear operator.
#+end_math-example

#+NAME: ex:linear-operator:quartic-qft
#+begin_math-example
One example of a nonlinear PDE is something like the $\phi^{4}$
model in quantum field theory

\begin{equation}
(\partial_{t}^{2}-\partial_{x}^{2})\phi + \phi^{3} = 0.
\end{equation}

This isn't linear, but how can we see this? Suppose we had two
solutions $\phi$ and $\psi$, then their sum equals

\begin{equation}
(\partial_{t}^{2}-\partial_{x}^{2})(\phi + \psi) + (\phi + \psi)^{3} = (\psi + \phi)^{3} - \phi^{3} - \psi^{3}.
\end{equation}

This is because only the cross terms in the cubic term remain after
plugging in the RHS of the PDE.
#+end_math-example

#+begin_remark
We belabor this point of linearity because, if we have a linear PDE
described by a linear differential operator $L(-)$, and we have any
two solutions $\mu_{1}$ and $\mu_{2}$, then we can construct
infinitely many solutions as a linear combination of these two
$c_{1}\mu_{1}+c_{2}\mu_{2}$ for any real number $c_{1}$, $c_{2}$.
#+end_remark

** Grocery List of Examples

We've seen the transport equation and the $\phi^{4}$ field
theory. Let's just enumerate some that we'd encounter in physics.

#+NAME: ex:pde:shock-wave
#+begin_math-example
The shock wave

\begin{equation}
\partial_{t}\mu + \mu\partial_{x}\mu = 0.
\end{equation}
#+end_math-example

#+begin_math-example
Laplace's equation

\begin{equation}
\partial_{x}^{2}\mu + \partial_{y}^{2}\mu = 0.
\end{equation}
#+end_math-example

#+NAME: ex:pde:wave-equation
#+begin_math-example
The wave equation

\begin{equation}
\partial_{t}^{2}\mu - \partial_{x}^{2}\mu = 0.
\end{equation}

We could add some self-interaction contribution, for example
including a cubic self-interaction gives us:

\begin{equation}
(\partial_{t}^{2} - \partial_{x}^{2})\mu + \mu^{3} = 0.
\end{equation}
#+end_math-example

#+NAME: ex:pde:dispersive-wave-equation
#+begin_math-example
The dispersive Wave equation

\begin{equation}
\partial_{t}\mu + \mu\partial_{x}\mu + \partial_{x}^{3}\mu = 0.
\end{equation}
#+end_math-example

#+NAME: ex:pde:schrodinger-equation
#+begin_math-example
The Schrodinger equation

\begin{equation}
\partial_{t}\mu -i\partial_{x}^{2}\mu = 0.
\end{equation}

#+end_math-example

#+NAME: defn:order-of-pdf
#+begin_definition
The {{{define(order)}}} of a partial differential equation is the
highest derivative's order. For mixed derivatives like
$\partial_{x}^{m}\partial_{y}^{n}$, we sum their order to get $m+n$.
#+end_definition

#+begin_theorem
If $L_{1}(-)$ is a differential operator of order $m$, and
$L_{2}(-)$ a differential operator of order $n$, then $L_{1}L_{2}$
is a differential operator of order $m+n$.
#+end_theorem

#+NAME: defn:linear-pde
#+begin_definition
We call a partial differential equation {{{define(Linear)}}} if any
linear combination of its solutions is again a solution.
#+end_definition

#+begin_definition
Let $L(f)=g(x,y,\dots,t)$ be a partial differential equation. Then
we call it {{{define(Homogeneous)}}} if $g=0$. Otherwise we call it
{{{define(Inhomogeneous)}}}.
#+end_definition

#+begin_math-example
Consider the partial differential equation

\begin{equation}
\partial_{t}^{2}\mu - \partial_{x}^{2}\mu + x^{4} = 0.
\end{equation}

It is linear and inhomogeneous.
#+end_math-example

#+begin_math-example
Consider the shockwave equation. We see we can rewrite it using the
chain rule as

\begin{equation}
\partial_{t}\mu + \frac{1}{2}\partial_{x}(\mu^{2}) = 0.
\end{equation}

If we introduce

\begin{equation}
\vartheta(\mu) = \mu^{2}
\end{equation}

then we can write

\begin{equation}
L = \partial_{t} + \frac{1}{2}\partial_{x}\circ\vartheta
\end{equation}

to render our equation

\begin{equation}
L(\mu) = 0.
\end{equation}

But that $\vartheta$ makes it a /nonlinear/ PDE.
#+end_math-example


* ODEs and PDEs revisited

