docs/math/pde/basics.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2021-04-11 Sun 12:09 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Partial Differential Equations</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Alex Nelson">
<link rel="preconnect" href="https://fonts.gstatic.com"><link href="https://fonts.googleapis.com/css2?family=Spectral&display=swap" rel="stylesheet">
<link href="https://fonts.googleapis.com/css2?family=Merriweather" rel="stylesheet">
<div style="display: none"> \(
\newcommand\D{\mathrm{d}}
\newcommand\E{\mathrm{e}}
\newcommand\I{\mathrm{i}}
\newcommand\bigOh{\mathcal{O}}
\newcommand{\cat}[1]{\mathbf{#1}}
\newcommand\curl{\vec{\nabla}\times}
\newcommand{\CC}{\mathbb{C}}
\newcommand{\NN}{\mathbb{N}}
\newcommand{\QQ}{\mathbb{Q}}
\newcommand{\RR}{\mathbb{R}}
\newcommand{\ZZ}{\mathbb{Z}}
\)</div>
<link rel="stylesheet" type="text/css" href="../../css/stylesheet.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="./index.html"> UP </a>
 |
 <a accesskey="H" href="../../index.html"> HOME </a>
</div><div id="content">
<h1 class="title">Partial Differential Equations</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#h-cbf8ddb3-c14c-49f5-9bad-216aaa0b8639">1. Introduction</a>
<ul>
<li><a href="#h-b03419e9-4de1-473c-917a-bdeeb70d5adb">1.1. Grocery List of Examples</a></li>
</ul>
</li>
<li><a href="#h-641fd899-e72f-444a-89d8-261dabdec2ae">2. ODEs and PDEs revisited</a>
<ul>
<li><a href="#h-2f1ccab1-d4c1-4f64-ae3a-7279224cc5ca">2.1. Solving an ODE</a></li>
<li><a href="#h-38b79876-cca2-4836-b386-4b8b3ae06ec0">2.2. For PDEs</a></li>
<li><a href="#h-6165a0a0-310a-4144-979d-3ac71a8a2c0d">2.3. Example with mixed derivatives</a></li>
</ul>
</li>
<li><a href="#h-fd1b7d8a-b2d7-48d6-a09e-f7ff6620ab8a">3. Geometric and Coordinate Perspectives</a>
<ul>
<li><a href="#h-22d49717-b4bc-4981-8de9-0789d0b6f600">3.1. Example: First-Order PDE with Constant Coefficients</a></li>
<li><a href="#h-79c80b03-d2d2-4895-b54c-d74dfb60a685">3.2. Coordinate Perspective</a></li>
</ul>
</li>
<li><a href="#h-e3e6c4cb-06e1-4ee1-a53c-8d0759967052">4. Variable Coefficient First-Order PDEs</a>
<ul>
<li><a href="#h-80d5359a-40e2-453c-b8a1-e5f7f3e673cd">4.1. Motivating Example</a>
<ul>
<li><a href="#h-a2a59290-f2b1-41ba-bc8f-72a1feeeba78">4.1.1. More generally</a></li>
</ul>
</li>
<li><a href="#h-51cba849-fba8-458f-9e28-ac516aec3e67">4.2. Steps involved in solving Homogeneous PDEs</a></li>
<li><a href="#h-8b648e77-9e8b-4fe5-a4ca-96f145812801">4.3. Steps involved in solving Inhomogeneous PDES</a></li>
</ul>
</li>
<li><a href="#h-43de617f-65f8-4f9d-b91d-6418e0ce8180">5. References</a></li>
</ul>
</div>
</div>

<div id="outline-container-h-cbf8ddb3-c14c-49f5-9bad-216aaa0b8639" class="outline-2">
<h2 id="h-cbf8ddb3-c14c-49f5-9bad-216aaa0b8639"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-h-cbf8ddb3-c14c-49f5-9bad-216aaa0b8639">
<div class="remark" id="org690c2d5">
<p>
The fundamental difference between partial differential equations
and ordinary differential equations is the number of variables
we're working with. For ODEs, we're usually working with functions
of time (or some other single parameter). Partial differential
equations use multiple independent variables (e.g., functions of
space and time).
</p>

<p>
One strategy to solve problems like
</p>

\begin{equation}
\sum^{n}_{\mu=0}a^{\mu}\partial_{\mu}f = 0
\end{equation}

<p>
is to rewrite this using a "linear operator"
</p>

\begin{equation}
\sum^{n}_{\mu=0}a^{\mu}\partial_{\mu} = L
\end{equation}

<p>
then our problem becomes
</p>

\begin{equation}
L(f) = 0.
\end{equation}

<p>
This amounts to finding the kernel of \(L\).
</p>

</div>

<div class="proposition" id="orge35f1a3">
<p>
Recall an operator \(L\) is linear if, for arbitrary constants
\(c_{1}\) and \(c_{2}\), we have
</p>

\begin{equation}
L(c_{1}\mu_{1} + c_{2}\mu_{2}) = c_{1}L(\mu_{1}) + c_{2}L(\mu_{2}).
\end{equation}

</div>

<div class="math-example" id="orga36bef6">
<p>
The <dfn>transport equation</dfn> in 2-dimensions looks like
</p>

\begin{equation}
(\partial_{x} + \partial_{y})\mu(x,y) = 0.
\end{equation}

<p>
This is indeed a linear operator.
</p>

</div>

<div class="math-example" id="orgcc7dbc7">
<p>
One example of a nonlinear PDE is something like the \(\phi^{4}\)
model in quantum field theory
</p>

\begin{equation}
(\partial_{t}^{2}-\partial_{x}^{2})\phi + \phi^{3} = 0.
\end{equation}

<p>
This isn't linear, but how can we see this? Suppose we had two
solutions \(\phi\) and \(\psi\), then their sum equals
</p>

\begin{equation}
(\partial_{t}^{2}-\partial_{x}^{2})(\phi + \psi) + (\phi + \psi)^{3} = (\psi + \phi)^{3} - \phi^{3} - \psi^{3}.
\end{equation}

<p>
This is because only the cross terms in the cubic term remain after
plugging in the RHS of the PDE.
</p>

</div>

<div class="remark" id="org0de92a3">
<p>
We belabor this point of linearity because, if we have a linear PDE
described by a linear differential operator \(L(-)\), and we have any
two solutions \(\mu_{1}\) and \(\mu_{2}\), then we can construct
infinitely many solutions as a linear combination of these two
\(c_{1}\mu_{1}+c_{2}\mu_{2}\) for any real number \(c_{1}\), \(c_{2}\).
</p>

</div>
</div>

<div id="outline-container-h-b03419e9-4de1-473c-917a-bdeeb70d5adb" class="outline-3">
<h3 id="h-b03419e9-4de1-473c-917a-bdeeb70d5adb"><span class="section-number-3">1.1</span> Grocery List of Examples</h3>
<div class="outline-text-3" id="text-h-b03419e9-4de1-473c-917a-bdeeb70d5adb">
<p>
We've seen the transport equation and the \(\phi^{4}\) field
theory. Let's just enumerate some that we'd encounter in physics.
</p>

<div class="math-example" id="org4d34da3">
<p>
The shock wave
</p>

\begin{equation}
\partial_{t}\mu + \mu\partial_{x}\mu = 0.
\end{equation}

</div>

<div class="math-example" id="org00c1914">
<p>
Laplace's equation
</p>

\begin{equation}
\partial_{x}^{2}\mu + \partial_{y}^{2}\mu = 0.
\end{equation}

</div>

<div class="math-example" id="org8c563d7">
<p>
The wave equation
</p>

\begin{equation}
\partial_{t}^{2}\mu - \partial_{x}^{2}\mu = 0.
\end{equation}

<p>
We could add some self-interaction contribution, for example
including a cubic self-interaction gives us:
</p>

\begin{equation}
(\partial_{t}^{2} - \partial_{x}^{2})\mu + \mu^{3} = 0.
\end{equation}

</div>

<div class="math-example" id="org3e86fd4">
<p>
The dispersive Wave equation
</p>

\begin{equation}
\partial_{t}\mu + \mu\partial_{x}\mu + \partial_{x}^{3}\mu = 0.
\end{equation}

</div>

<div class="math-example" id="orgd20aa6a">
<p>
The Schrodinger equation
</p>

\begin{equation}
\partial_{t}\mu -i\partial_{x}^{2}\mu = 0.
\end{equation}

</div>

<div class="definition" id="orgd2513d3">
<p>
The <dfn>order</dfn> of a partial differential equation is the
highest derivative's order. For mixed derivatives like
\(\partial_{x}^{m}\partial_{y}^{n}\), we sum their order to get \(m+n\).
</p>

</div>

<div class="theorem" id="orge05a86f">
<p>
If \(L_{1}(-)\) is a differential operator of order \(m\), and
\(L_{2}(-)\) a differential operator of order \(n\), then \(L_{1}L_{2}\)
is a differential operator of order \(m+n\).
</p>

</div>

<div class="definition" id="orgd5ec974">
<p>
We call a partial differential equation <dfn>Linear</dfn> if any
linear combination of its solutions is again a solution.
</p>

</div>

<div class="definition" id="org3b5bcb1">
<p>
Let \(L(f)=g(x,y,\dots,t)\) be a partial differential equation. Then
we call it <dfn>Homogeneous</dfn> if \(g=0\). Otherwise we call it
<dfn>Inhomogeneous</dfn>.
</p>

</div>

<div class="math-example" id="org169bf6f">
<p>
Consider the partial differential equation
</p>

\begin{equation}
\partial_{t}^{2}\mu - \partial_{x}^{2}\mu + x^{4} = 0.
\end{equation}

<p>
It is linear and inhomogeneous.
</p>

</div>

<div class="math-example" id="org3a8ff00">
<p>
Consider the shockwave equation. We see we can rewrite it using the
chain rule as
</p>

\begin{equation}
\partial_{t}\mu + \frac{1}{2}\partial_{x}(\mu^{2}) = 0.
\end{equation}

<p>
If we introduce
</p>

\begin{equation}
\vartheta(\mu) = \mu^{2}
\end{equation}

<p>
then we can write
</p>

\begin{equation}
L = \partial_{t} + \frac{1}{2}\partial_{x}\circ\vartheta
\end{equation}

<p>
to render our equation
</p>

\begin{equation}
L(\mu) = 0.
\end{equation}

<p>
But that \(\vartheta\) makes it a <i>nonlinear</i> PDE.
</p>

</div>
</div>
</div>
</div>


<div id="outline-container-h-641fd899-e72f-444a-89d8-261dabdec2ae" class="outline-2">
<h2 id="h-641fd899-e72f-444a-89d8-261dabdec2ae"><span class="section-number-2">2</span> ODEs and PDEs revisited</h2>
<div class="outline-text-2" id="text-h-641fd899-e72f-444a-89d8-261dabdec2ae">
</div>
