math/pde/basics.org
** Solving an ODE
Suppose we had the ODE

\begin{equation}
\frac{\D^{2}\mu(x)}{\D x^{2}} = 0.
\end{equation}

We can integrate it once. The left-hand side becomes

\begin{equation}
\int LHS\,\D x = \int\frac{\D}{\D x}\left(\frac{\D\mu(x)}{\D x}\right)\D x =
\frac{\D\mu(x)}{\D x} + c_{1}.
\end{equation}

The right-hand side

\begin{equation}
\int RHS\,\D x = \int 0\,\D x = 0.
\end{equation}

Setting the two equal gives us

\begin{equation}
\frac{\D\mu(x)}{\D x} + c_{1} = 0.
\end{equation}

Integrating again with respect to $x$ gives us

\begin{equation}
\int LHS\,\D x = \int \frac{\D}{\D x}(\mu(x))\,\D x + \int c_{1}\,\D x =
\mu(x) + c_{0} + c_{1}x
\end{equation}

The right-hand side again vanishes. The constants of integration
$c_{0}$ and $c_{1}$ encode the initial conditions:

\begin{equation}
\mu(0) = -c_{0}
\end{equation}

and

\begin{equation}
\mu'(0) = -c_{1}.
\end{equation}

** For PDEs

If we try to solve a partial differential equation in this manner,
well, let's just make $\mu$ a function of two variables. So solving

\begin{equation}
\partial_{x}^{2}\mu(x,y) = 0
\end{equation}

using the same strategy. The first integral with respect to $x$
gives us

\begin{equation}
\partial_{x}\mu(x,y) + c_{1}(y) = 0
\end{equation}

and the second integral gives us

\begin{equation}
\mu(x,y) + c_{0}(y) + c_{1}(y)\cdot x = 0.
\end{equation}

Then we have

\begin{equation}
\mu(x,y) = -c_{0}(y) - c_{1}(y)\cdot x
\end{equation}

where $\mu(0,y) = \mu_{0}(y) = -c_{0}(y)$ is one initial condition,
so

\begin{equation}
\mu(x,y) = \mu_{0}(y) - c_{1}(y)\cdot x.
\end{equation}

Compare this to the general solution to the second-order ODE.

** Example with mixed derivatives

Consider the PDE

\begin{equation}
\partial_{x}\partial_{y}\mu(x,y) = 0.
\end{equation}

We assume the function $\partial_{x}\partial_{y}\mu(x,y)$ is
continuous, so we could ostensibly swap the order of
differentiation. We integrate the left-hand side of our PDE with
respect to $x$ to get

\begin{equation}
\int\partial_{x}\bigl(\partial_{y}\mu(x,y)\bigr)\D x =
\partial_{y}\mu(x,y) + f(y).
\end{equation}

Integrating the right-hand side of our PDE gives us zero, so we
have the first-integral yield:

\begin{equation}
\partial_{y}\mu(x,y) + f(y) = 0.
\end{equation}

We can integrate with respect to $y$, rearranging terms, to find

\begin{equation}
\mu(x,y) = g(x) - \int f(y)\,\D y.
\end{equation}

Here $g(x)$ is the "integration constant" with respect to $y$.

* Geometric and Coordinate Perspectives

We will start solving simple partial differential equations
geometrically. Starting with simple first-order PDEs to demonstrate
the method, it generalizes to more complicated first-order PDEs.

Remember how we write vectors in calculus using the unit-vectors

\begin{equation}
\vec{v} = v_{1}\mathbf{i} + v_{2}\mathbf{j} + v_{3}\mathbf{k}.
\end{equation}

We can pretend that partial derivatives are unit vectors, writing
instead

\begin{equation}
\vec{v} = v_{1}\partial_{x} + v_{2}\partial_{y} +
v_{3}\partial_{z}.
\end{equation}

This is justified by appealing to differential geometry, where this
is in fact a tangent vector.

#+begin_remark
In vector calculus, we have directional derivatives of scalar
functions given by $\vec{v}\cdot\vec{\nabla} f$. This is also
written as $\partial_{\vec{v}}f$ and is coordinate independent.
#+end_remark

#+begin_remark
We frequently use Einstein notation to track sums for us. Instead
of using subscripts, we could write

\begin{equation}
\vec{v} = v^{1}\partial_{1} + v^{2}\partial_{2} +
v^{3}\partial_{3}.
\end{equation}

Then permitting us to contract upper indices with any matching
lower indices

\begin{equation}
v^{\mu}\partial_{\mu} := \sum_{\mu=1}^{3}v^{\mu}\partial_{\mu}.
\end{equation}

This comes in handy. But be careful: we sum over contracted
indices, when there's an index "upstairs" matching an index
"downstairs". If both indices are "downstairs", there's no
summation in Einstein convention.

One quirk of Einstein convention, when we sum over a contracted
index, we refer to that variable as a "dummy index". We can relabel
it to any fresh variable

\begin{equation}
v^{\mu}\partial_{\mu} = v^{\alpha}\partial_{\alpha}
\end{equation}

because both sides are the same sums. We just have to be careful to
relabel /all/ instances of the dummy variable.

The other quirk is, if $x^{\mu}$ is a coordinate vector, then the
partial derivative with respect to it (i.e., the gradient) is a
lower-indexed quantity

\begin{equation}
\frac{\partial}{\partial x^{\mu}} = \partial_{\mu}.
\end{equation}

When we change coordinates to $y^{\nu}=y^{\nu}(x^{1},\dots,
x^{n})$, we see the chain rule requires us

\begin{equation}
\frac{\partial}{\partial y^{\nu}}
 = \frac{\partial x^{\mu}}{\partial y^{\nu}}\frac{\partial}{\partial x^{\mu}}
\end{equation}

multiply by the Jacobian matrix. On the other hand, the
coefficients to a vector transforms as

\begin{equation}
v^{\mu}\to v^{\mu}\frac{\partial y^{\nu}}{\partial x^{\mu}},
\end{equation}

i.e., by multiplying by the inverse matrix of the Jacobian.

Very rarely in the literature there's a "Euclidean summation
convention" discussed where we sum over /any/ repeated index,
regardless whether they both live upstairs, downstairs, or mixed.
We use Einstein convention.
#+end_remark

#+begin_theorem
The quantity

\begin{equation}
\vec{v} = v^{\mu}\partial_{\mu}
\end{equation}

is coordinate independent.
#+end_theorem
#+begin_proof
We can see this by changing coordinates $x^{\mu}\to y^{\nu}$,
the coefficients $v^{\mu}$ transform as

\begin{equation}
v^{\mu}\to\widetilde{v}^{\nu} = \frac{\partial y^{\nu}}{\partial x^{\mu}}v^{\mu}.
\end{equation}

The partial derivatives transform as

\begin{equation}
\partial_{\mu}\to\widetilde{\partial}_{\nu}=\frac{\partial x^{\mu}}{\partial y^{\nu}}\frac{\partial}{\partial x^{\mu}}.
\end{equation}

Changing the dummy variables of the tilde quantities, we find

\begin{equation}
v^{\mu}\partial_{\mu} \to \widetilde{v}^{\nu}\widetilde{\partial}_{\nu}=\left(\frac{\partial y^{\nu}}{\partial x^{\alpha}}v^{\alpha}\right)\left(\frac{\partial x^{\beta}}{\partial y^{\nu}}\frac{\partial}{\partial x^{\beta}}\right).
\end{equation}

Contracting the $\nu$ indices on the Jacobian and its inverse gives
us the identity matrix (Kronecker delta)

\begin{equation}
\left(\frac{\partial y^{\nu}}{\partial x^{\alpha}}v^{\alpha}\right)\left(\frac{\partial x^{\beta}}{\partial y^{\nu}}\frac{\partial}{\partial x^{\beta}}\right).
={\delta_{\alpha}}^{\beta}v^{\alpha}\partial_{\beta}.
\end{equation}

This is precisely the same as summing over both $\alpha$ and
$\beta$, but the Kronecker delta vanishes when $\alpha\neq\beta$,
so

\begin{equation}
{\delta_{\alpha}}^{\beta}v^{\alpha}\partial_{\beta} = \sum_{\gamma}v^{\gamma}\partial_{\gamma}
\end{equation}

precisely as desired.
#+end_proof

