docs/math/pde/basics.html

<div id="outline-container-h-2f1ccab1-d4c1-4f64-ae3a-7279224cc5ca" class="outline-3">
<h3 id="h-2f1ccab1-d4c1-4f64-ae3a-7279224cc5ca"><span class="section-number-3">2.1</span> Solving an ODE</h3>
<div class="outline-text-3" id="text-h-2f1ccab1-d4c1-4f64-ae3a-7279224cc5ca">
<p>
Suppose we had the ODE
</p>

\begin{equation}
\frac{\D^{2}\mu(x)}{\D x^{2}} = 0.
\end{equation}

<p>
We can integrate it once. The left-hand side becomes
</p>

\begin{equation}
\int LHS\,\D x = \int\frac{\D}{\D x}\left(\frac{\D\mu(x)}{\D x}\right)\D x =
\frac{\D\mu(x)}{\D x} + c_{1}.
\end{equation}

<p>
The right-hand side
</p>

\begin{equation}
\int RHS\,\D x = \int 0\,\D x = 0.
\end{equation}

<p>
Setting the two equal gives us
</p>

\begin{equation}
\frac{\D\mu(x)}{\D x} + c_{1} = 0.
\end{equation}

<p>
Integrating again with respect to \(x\) gives us
</p>

\begin{equation}
\int LHS\,\D x = \int \frac{\D}{\D x}(\mu(x))\,\D x + \int c_{1}\,\D x =
\mu(x) + c_{0} + c_{1}x
\end{equation}

<p>
The right-hand side again vanishes. The constants of integration
\(c_{0}\) and \(c_{1}\) encode the initial conditions:
</p>

\begin{equation}
\mu(0) = -c_{0}
\end{equation}

<p>
and
</p>

\begin{equation}
\mu'(0) = -c_{1}.
\end{equation}
</div>
</div>

<div id="outline-container-h-38b79876-cca2-4836-b386-4b8b3ae06ec0" class="outline-3">
<h3 id="h-38b79876-cca2-4836-b386-4b8b3ae06ec0"><span class="section-number-3">2.2</span> For PDEs</h3>
<div class="outline-text-3" id="text-h-38b79876-cca2-4836-b386-4b8b3ae06ec0">
<p>
If we try to solve a partial differential equation in this manner,
well, let's just make \(\mu\) a function of two variables. So solving
</p>

\begin{equation}
\partial_{x}^{2}\mu(x,y) = 0
\end{equation}

<p>
using the same strategy. The first integral with respect to \(x\)
gives us
</p>

\begin{equation}
\partial_{x}\mu(x,y) + c_{1}(y) = 0
\end{equation}

<p>
and the second integral gives us
</p>

\begin{equation}
\mu(x,y) + c_{0}(y) + c_{1}(y)\cdot x = 0.
\end{equation}

<p>
Then we have
</p>

\begin{equation}
\mu(x,y) = -c_{0}(y) - c_{1}(y)\cdot x
\end{equation}

<p>
where \(\mu(0,y) = \mu_{0}(y) = -c_{0}(y)\) is one initial condition,
so
</p>

\begin{equation}
\mu(x,y) = \mu_{0}(y) - c_{1}(y)\cdot x.
\end{equation}

<p>
Compare this to the general solution to the second-order ODE.
</p>
</div>
</div>

<div id="outline-container-h-6165a0a0-310a-4144-979d-3ac71a8a2c0d" class="outline-3">
<h3 id="h-6165a0a0-310a-4144-979d-3ac71a8a2c0d"><span class="section-number-3">2.3</span> Example with mixed derivatives</h3>
<div class="outline-text-3" id="text-h-6165a0a0-310a-4144-979d-3ac71a8a2c0d">
<p>
Consider the PDE
</p>

\begin{equation}
\partial_{x}\partial_{y}\mu(x,y) = 0.
\end{equation}

<p>
We assume the function \(\partial_{x}\partial_{y}\mu(x,y)\) is
continuous, so we could ostensibly swap the order of
differentiation. We integrate the left-hand side of our PDE with
respect to \(x\) to get
</p>

\begin{equation}
\int\partial_{x}\bigl(\partial_{y}\mu(x,y)\bigr)\D x =
\partial_{y}\mu(x,y) + f(y).
\end{equation}

<p>
Integrating the right-hand side of our PDE gives us zero, so we
have the first-integral yield:
</p>

\begin{equation}
\partial_{y}\mu(x,y) + f(y) = 0.
\end{equation}

<p>
We can integrate with respect to \(y\), rearranging terms, to find
</p>

\begin{equation}
\mu(x,y) = g(x) - \int f(y)\,\D y.
\end{equation}

<p>
Here \(g(x)\) is the "integration constant" with respect to \(y\).
</p>
</div>
</div>
</div>

<div id="outline-container-h-fd1b7d8a-b2d7-48d6-a09e-f7ff6620ab8a" class="outline-2">
<h2 id="h-fd1b7d8a-b2d7-48d6-a09e-f7ff6620ab8a"><span class="section-number-2">3</span> Geometric and Coordinate Perspectives</h2>
<div class="outline-text-2" id="text-h-fd1b7d8a-b2d7-48d6-a09e-f7ff6620ab8a">
<p>
We will start solving simple partial differential equations
geometrically. Starting with simple first-order PDEs to demonstrate
the method, it generalizes to more complicated first-order PDEs.
</p>

<p>
Remember how we write vectors in calculus using the unit-vectors
</p>

\begin{equation}
\vec{v} = v_{1}\mathbf{i} + v_{2}\mathbf{j} + v_{3}\mathbf{k}.
\end{equation}

<p>
We can pretend that partial derivatives are unit vectors, writing
instead
</p>

\begin{equation}
\vec{v} = v_{1}\partial_{x} + v_{2}\partial_{y} +
v_{3}\partial_{z}.
\end{equation}

<p>
This is justified by appealing to differential geometry, where this
is in fact a tangent vector.
</p>

<div class="remark" id="orgd8ccb31">
<p>
In vector calculus, we have directional derivatives of scalar
functions given by \(\vec{v}\cdot\vec{\nabla} f\). This is also
written as \(\partial_{\vec{v}}f\) and is coordinate independent.
</p>

</div>

<div class="remark" id="org6a6e9ca">
<p>
We frequently use Einstein notation to track sums for us. Instead
of using subscripts, we could write
</p>

\begin{equation}
\vec{v} = v^{1}\partial_{1} + v^{2}\partial_{2} +
v^{3}\partial_{3}.
\end{equation}

<p>
Then permitting us to contract upper indices with any matching
lower indices
</p>

\begin{equation}
v^{\mu}\partial_{\mu} := \sum_{\mu=1}^{3}v^{\mu}\partial_{\mu}.
\end{equation}

<p>
This comes in handy. But be careful: we sum over contracted
indices, when there's an index "upstairs" matching an index
"downstairs". If both indices are "downstairs", there's no
summation in Einstein convention.
</p>

<p>
One quirk of Einstein convention, when we sum over a contracted
index, we refer to that variable as a "dummy index". We can relabel
it to any fresh variable
</p>

\begin{equation}
v^{\mu}\partial_{\mu} = v^{\alpha}\partial_{\alpha}
\end{equation}

<p>
because both sides are the same sums. We just have to be careful to
relabel <i>all</i> instances of the dummy variable.
</p>

<p>
The other quirk is, if \(x^{\mu}\) is a coordinate vector, then the
partial derivative with respect to it (i.e., the gradient) is a
lower-indexed quantity
</p>

\begin{equation}
\frac{\partial}{\partial x^{\mu}} = \partial_{\mu}.
\end{equation}

<p>
When we change coordinates to \(y^{\nu}=y^{\nu}(x^{1},\dots,
x^{n})\), we see the chain rule requires us
</p>

\begin{equation}
\frac{\partial}{\partial y^{\nu}}
 = \frac{\partial x^{\mu}}{\partial y^{\nu}}\frac{\partial}{\partial x^{\mu}}
\end{equation}

<p>
multiply by the Jacobian matrix. On the other hand, the
coefficients to a vector transforms as
</p>

\begin{equation}
v^{\mu}\to v^{\mu}\frac{\partial y^{\nu}}{\partial x^{\mu}},
\end{equation}

<p>
i.e., by multiplying by the inverse matrix of the Jacobian.
</p>

<p>
Very rarely in the literature there's a "Euclidean summation
convention" discussed where we sum over <i>any</i> repeated index,
regardless whether they both live upstairs, downstairs, or mixed.
We use Einstein convention.
</p>

</div>

<div class="theorem" id="orga60c90d">
<p>
The quantity
</p>

\begin{equation}
\vec{v} = v^{\mu}\partial_{\mu}
\end{equation}

<p>
is coordinate independent.
</p>

</div>
<div class="proof" id="org2d6d528">
<p>
We can see this by changing coordinates \(x^{\mu}\to y^{\nu}\),
the coefficients \(v^{\mu}\) transform as
</p>

\begin{equation}
v^{\mu}\to\widetilde{v}^{\nu} = \frac{\partial y^{\nu}}{\partial x^{\mu}}v^{\mu}.
\end{equation}

<p>
The partial derivatives transform as
</p>

\begin{equation}
\partial_{\mu}\to\widetilde{\partial}_{\nu}=\frac{\partial x^{\mu}}{\partial y^{\nu}}\frac{\partial}{\partial x^{\mu}}.
\end{equation}

<p>
Changing the dummy variables of the tilde quantities, we find
</p>

\begin{equation}
v^{\mu}\partial_{\mu} \to \widetilde{v}^{\nu}\widetilde{\partial}_{\nu}=\left(\frac{\partial y^{\nu}}{\partial x^{\alpha}}v^{\alpha}\right)\left(\frac{\partial x^{\beta}}{\partial y^{\nu}}\frac{\partial}{\partial x^{\beta}}\right).
\end{equation}

<p>
Contracting the \(\nu\) indices on the Jacobian and its inverse gives
us the identity matrix (Kronecker delta)
</p>

\begin{equation}
\left(\frac{\partial y^{\nu}}{\partial x^{\alpha}}v^{\alpha}\right)\left(\frac{\partial x^{\beta}}{\partial y^{\nu}}\frac{\partial}{\partial x^{\beta}}\right).
={\delta_{\alpha}}^{\beta}v^{\alpha}\partial_{\beta}.
\end{equation}

<p>
This is precisely the same as summing over both \(\alpha\) and
\(\beta\), but the Kronecker delta vanishes when \(\alpha\neq\beta\),
so
</p>

\begin{equation}
{\delta_{\alpha}}^{\beta}v^{\alpha}\partial_{\beta} = \sum_{\gamma}v^{\gamma}\partial_{\gamma}
\end{equation}

<p>
precisely as desired.
</p>

</div>
</div>
