math/pde/basics.org
** Example: First-Order PDE with Constant Coefficients

Consider the partial differential equations

\begin{equation}
a\partial_{x}\mu(x,y) + b\partial_{y}\mu(x,y) = 0
\end{equation}

where $a$ and $b$ are real constants. We could introduce

\begin{equation}
v^{\alpha}\partial_{\alpha} = a\partial_{x} + b\partial_{y}
\end{equation}

so our PDE is

\begin{equation}
v^{\alpha}\partial_{\alpha}\mu = (\vec{v}\cdot\vec{\nabla})\mu.
\end{equation}

So far, so good, right?

Our first step is to consider a vector /orthogonal/ to
$v^{\alpha}$, i.e., a $\vec{w}$ such that $\vec{v}\cdot\vec{w}=0$.
One obvious candidate is

\begin{equation}
\vec{w} = -b\mathbf{i} + a\mathbf{j}.
\end{equation}

So what do we do now? If we write

\begin{equation}
\mu(x,y) = f(-v^{2}x + v^{1}y)
\end{equation}

for some $f(-)$, then we see this satisfies our partial
differential equation. The reader can verify

\begin{equation}
(v^{1}\partial_{1} + v^{2}\partial_{2})f(-v^{2}x + v^{1}y) = 0.
\end{equation}

More generally, we find for some $\vec{w}$ orthogonal to $\vec{v}$
that the general solution to the PDE may be constructed as

\begin{equation}
\mu(x^{1},\dots,x^{n}) = f(\vec{w}\cdot\vec{x}) = f(w^{1}x^{1} + \dots + w^{n}x^{n})
\end{equation}

for arbitrary $f$, whenever we have
$\mu\colon\mathbb{R}^{n}\to\mathbb{R}$.

#+begin_definition
The lines described by
\begin{equation}
\vec{w}\cdot\vec{x} = \mbox{constant}
\end{equation}
are called {{{define(Characteristic Lines)}}}.
#+end_definition

So $c = \vec{w}\cdot\vec{x}$ is a constant.
And, ta-duh, remember from geometry that $f(c) = \mu(\vec{x})$
describes a surface. This is where geometry comes up.

** Coordinate Perspective

When we write

\begin{equation}
a\partial_{x}\mu(x,y) + b\partial_{y}\mu(x,y) =
\vec{v}\cdot\vec{\nabla}\mu(x,y) = 0
\end{equation}

then we just need to rotate to make $\vec{v}=(v,0)$. This rotation
corresponds to the transformation of coordinates

\begin{equation}
x' = ax + by
\end{equation}

and

\begin{equation}
y' = -bx + ay.
\end{equation}

Then our differential operator becomes

\begin{equation}
a\partial_{x} + b\partial_{y} = a(a\partial_{x'} + b\partial_{y'})
  + b a(b\partial_{x'} - a\partial_{y'})
\end{equation}

which simplifies to

\begin{equation}
a\partial_{x} + b\partial_{y} = (a^{2} + b^{2})\partial_{x'}.
\end{equation}

Hence we obtain the PDE

\begin{equation}
(a^{2} + b^{2})\partial_{x'}\mu(x',y') = 0
\end{equation}

which has its general solution be independent of $x'$

\begin{equation}
\mu(x',y') = f(y') = f(-bx + ay).
\end{equation}

This coincides completely with the geometric approach.

* Variable Coefficient First-Order PDEs

** Motivating Example

Consider the PDE

\begin{equation}
\partial_{x}\mu(x,y) + y\partial_{y}\mu(x,y) = 0.
\end{equation}

This corresponds to the directional derivative in the direction of the vector field given by

\begin{equation}
\vec{v} = (1, y).
\end{equation}

The integral curves associated to this look like

\begin{equation}
\frac{\D y}{\D x} = y \implies y(x) = y_{0}e^{x}.
\end{equation}

We recover our original PDE from the total derivative

\begin{equation}
\frac{\D}{\D x}\mu(x, y(x)) = (\partial_{x} + \frac{\D y}{\D x}\partial_{y})\mu(x,y(x)) = 0.
\end{equation}

We find when we set $x=0$ that $\mu(0, y_{0})$ is independent of
$x$. So we write from $y = y_{0}e^{x}$ that $ye^{-x} = y_{0}$ which
is constant with respect to $x$. Hence

\begin{equation}
\frac{\D}{\D x}f(y_{0}) = 0,
\end{equation}

and we just insist $\mu(x,y) = f(y_{0}) = f(ye^{-x})$.

*** More generally

If we have

\begin{equation}
a(x,y)\partial_{x}\mu(x,y) + b(x,y)\partial_{y}\mu(x,y) = c(x,y)
\end{equation}

then we could look at the graph of the function $\mu(x,y)$

\begin{equation}
S := \{(x,y,\mu(x,y))\}
\end{equation}

as defining a surface. We really want to construct this surface,
because it's the solution to our PDE.

Its normal vector is given by

\begin{equation}
\vec{n} = (\partial_{x}\mu(x,y), \partial_{y}\mu(x,y), -1).
\end{equation}

Hence our PDE is equivalent to asserting the vector $(a(x,y),
b(x,y), c(x,y))$ is orthogonal to the normal vector. Geometry tells
us that this vector lies in the tangent plane to a point on the
surface.

We start by looking for a curve $\gamma\colon[0,1]\to S$ which fits
the PDE's initial conditions. This is secretly the same as looking
for a particular solution of the PDE. The tangent vector for
$\gamma(s)$ is tangent to the surface. So it satisfies the system
of equations

\begin{align}
\frac{\D x(s)}{\D s} &= a(x(s), y(s))\\
\frac{\D y(s)}{\D s} &= b(x(s), y(s))\\
\frac{\D z(s)}{\D s} &= c(x(s), y(s))
\end{align}

Once we have a solution, we reconstruct the surface $S$ as a union
of these curves. The resulting surface is called the
{{{define(Integral Surface)}}} for the vector field.

#+NAME: defn:pde:characteristic-curves
#+begin_definition
Integral curves for the vector field $(a(x,y), b(x,y), c(x,y))$ are
called {{{define(Characteristic Curves)}}}.
#+end_definition

