docs/math/pde/basics.html

<div id="outline-container-h-22d49717-b4bc-4981-8de9-0789d0b6f600" class="outline-3">
<h3 id="h-22d49717-b4bc-4981-8de9-0789d0b6f600"><span class="section-number-3">3.1</span> Example: First-Order PDE with Constant Coefficients</h3>
<div class="outline-text-3" id="text-h-22d49717-b4bc-4981-8de9-0789d0b6f600">
<p>
Consider the partial differential equations
</p>

\begin{equation}
a\partial_{x}\mu(x,y) + b\partial_{y}\mu(x,y) = 0
\end{equation}

<p>
where \(a\) and \(b\) are real constants. We could introduce
</p>

\begin{equation}
v^{\alpha}\partial_{\alpha} = a\partial_{x} + b\partial_{y}
\end{equation}

<p>
so our PDE is
</p>

\begin{equation}
v^{\alpha}\partial_{\alpha}\mu = (\vec{v}\cdot\vec{\nabla})\mu.
\end{equation}

<p>
So far, so good, right?
</p>

<p>
Our first step is to consider a vector <i>orthogonal</i> to
\(v^{\alpha}\), i.e., a \(\vec{w}\) such that \(\vec{v}\cdot\vec{w}=0\).
One obvious candidate is
</p>

\begin{equation}
\vec{w} = -b\mathbf{i} + a\mathbf{j}.
\end{equation}

<p>
So what do we do now? If we write
</p>

\begin{equation}
\mu(x,y) = f(-v^{2}x + v^{1}y)
\end{equation}

<p>
for some \(f(-)\), then we see this satisfies our partial
differential equation. The reader can verify
</p>

\begin{equation}
(v^{1}\partial_{1} + v^{2}\partial_{2})f(-v^{2}x + v^{1}y) = 0.
\end{equation}

<p>
More generally, we find for some \(\vec{w}\) orthogonal to \(\vec{v}\)
that the general solution to the PDE may be constructed as
</p>

\begin{equation}
\mu(x^{1},\dots,x^{n}) = f(\vec{w}\cdot\vec{x}) = f(w^{1}x^{1} + \dots + w^{n}x^{n})
\end{equation}

<p>
for arbitrary \(f\), whenever we have
\(\mu\colon\mathbb{R}^{n}\to\mathbb{R}\).
</p>

<div class="definition" id="org1b96bb5">
<p>
The lines described by
</p>
\begin{equation}
\vec{w}\cdot\vec{x} = \mbox{constant}
\end{equation}
<p>
are called <dfn>Characteristic Lines</dfn>.
</p>

</div>

<p>
So \(c = \vec{w}\cdot\vec{x}\) is a constant.
And, ta-duh, remember from geometry that \(f(c) = \mu(\vec{x})\)
describes a surface. This is where geometry comes up.
</p>
</div>
</div>

<div id="outline-container-h-79c80b03-d2d2-4895-b54c-d74dfb60a685" class="outline-3">
<h3 id="h-79c80b03-d2d2-4895-b54c-d74dfb60a685"><span class="section-number-3">3.2</span> Coordinate Perspective</h3>
<div class="outline-text-3" id="text-h-79c80b03-d2d2-4895-b54c-d74dfb60a685">
<p>
When we write
</p>

\begin{equation}
a\partial_{x}\mu(x,y) + b\partial_{y}\mu(x,y) =
\vec{v}\cdot\vec{\nabla}\mu(x,y) = 0
\end{equation}

<p>
then we just need to rotate to make \(\vec{v}=(v,0)\). This rotation
corresponds to the transformation of coordinates
</p>

\begin{equation}
x' = ax + by
\end{equation}

<p>
and
</p>

\begin{equation}
y' = -bx + ay.
\end{equation}

<p>
Then our differential operator becomes
</p>

\begin{equation}
a\partial_{x} + b\partial_{y} = a(a\partial_{x'} + b\partial_{y'})
  + b a(b\partial_{x'} - a\partial_{y'})
\end{equation}

<p>
which simplifies to
</p>

\begin{equation}
a\partial_{x} + b\partial_{y} = (a^{2} + b^{2})\partial_{x'}.
\end{equation}

<p>
Hence we obtain the PDE
</p>

\begin{equation}
(a^{2} + b^{2})\partial_{x'}\mu(x',y') = 0
\end{equation}

<p>
which has its general solution be independent of \(x'\)
</p>

\begin{equation}
\mu(x',y') = f(y') = f(-bx + ay).
\end{equation}

<p>
This coincides completely with the geometric approach.
</p>
</div>
</div>
</div>

<div id="outline-container-h-e3e6c4cb-06e1-4ee1-a53c-8d0759967052" class="outline-2">
<h2 id="h-e3e6c4cb-06e1-4ee1-a53c-8d0759967052"><span class="section-number-2">4</span> Variable Coefficient First-Order PDEs</h2>
<div class="outline-text-2" id="text-h-e3e6c4cb-06e1-4ee1-a53c-8d0759967052">
</div>

<div id="outline-container-h-80d5359a-40e2-453c-b8a1-e5f7f3e673cd" class="outline-3">
<h3 id="h-80d5359a-40e2-453c-b8a1-e5f7f3e673cd"><span class="section-number-3">4.1</span> Motivating Example</h3>
<div class="outline-text-3" id="text-h-80d5359a-40e2-453c-b8a1-e5f7f3e673cd">
<p>
Consider the PDE
</p>

\begin{equation}
\partial_{x}\mu(x,y) + y\partial_{y}\mu(x,y) = 0.
\end{equation}

<p>
This corresponds to the directional derivative in the direction of the vector field given by
</p>

\begin{equation}
\vec{v} = (1, y).
\end{equation}

<p>
The integral curves associated to this look like
</p>

\begin{equation}
\frac{\D y}{\D x} = y \implies y(x) = y_{0}e^{x}.
\end{equation}

<p>
We recover our original PDE from the total derivative
</p>

\begin{equation}
\frac{\D}{\D x}\mu(x, y(x)) = (\partial_{x} + \frac{\D y}{\D x}\partial_{y})\mu(x,y(x)) = 0.
\end{equation}

<p>
We find when we set \(x=0\) that \(\mu(0, y_{0})\) is independent of
\(x\). So we write from \(y = y_{0}e^{x}\) that \(ye^{-x} = y_{0}\) which
is constant with respect to \(x\). Hence
</p>

\begin{equation}
\frac{\D}{\D x}f(y_{0}) = 0,
\end{equation}

<p>
and we just insist \(\mu(x,y) = f(y_{0}) = f(ye^{-x})\).
</p>
</div>

<div id="outline-container-h-a2a59290-f2b1-41ba-bc8f-72a1feeeba78" class="outline-4">
<h4 id="h-a2a59290-f2b1-41ba-bc8f-72a1feeeba78"><span class="section-number-4">4.1.1</span> More generally</h4>
<div class="outline-text-4" id="text-h-a2a59290-f2b1-41ba-bc8f-72a1feeeba78">
<p>
If we have
</p>

\begin{equation}
a(x,y)\partial_{x}\mu(x,y) + b(x,y)\partial_{y}\mu(x,y) = c(x,y)
\end{equation}

<p>
then we could look at the graph of the function \(\mu(x,y)\)
</p>

\begin{equation}
S := \{(x,y,\mu(x,y))\}
\end{equation}

<p>
as defining a surface. We really want to construct this surface,
because it's the solution to our PDE.
</p>

<p>
Its normal vector is given by
</p>

\begin{equation}
\vec{n} = (\partial_{x}\mu(x,y), \partial_{y}\mu(x,y), -1).
\end{equation}

<p>
Hence our PDE is equivalent to asserting the vector \((a(x,y),
b(x,y), c(x,y))\) is orthogonal to the normal vector. Geometry tells
us that this vector lies in the tangent plane to a point on the
surface.
</p>

<p>
We start by looking for a curve \(\gamma\colon[0,1]\to S\) which fits
the PDE's initial conditions. This is secretly the same as looking
for a particular solution of the PDE. The tangent vector for
\(\gamma(s)\) is tangent to the surface. So it satisfies the system
of equations
</p>

\begin{align}
\frac{\D x(s)}{\D s} &= a(x(s), y(s))\\
\frac{\D y(s)}{\D s} &= b(x(s), y(s))\\
\frac{\D z(s)}{\D s} &= c(x(s), y(s))
\end{align}

<p>
Once we have a solution, we reconstruct the surface \(S\) as a union
of these curves. The resulting surface is called the
<dfn>Integral Surface</dfn> for the vector field.
</p>

<div class="definition" id="org2608e79">
<p>
Integral curves for the vector field \((a(x,y), b(x,y), c(x,y))\) are
called <dfn>Characteristic Curves</dfn>.
</p>

</div>
</div>
</div>
</div>
