math/pde/basics.org
** Steps involved in solving Homogeneous PDEs

To solve

\begin{equation}
\vec{a}(\vec{x})\cdot\vec{\nabla}\mu = 0
\end{equation}

we enumerate the steps as follows:

1. Parametrize the PDE: $\D x^{i}(s)/\D s = a^{i}(\vec{x}(s))$ for $i=1,\dots,n$, and
   $\D\mu(s)/\D s = 0$
2. Parametrize the initial conditions
   - Introduce parameters $\xi$
   - Set $s=0$
   - This gives us initial conditions for $\vec{x}(0) = \vec{\xi}$ and $\mu(0)=\mu_{0}(\vec{\xi})$.
3. Find the characteristic curves
   - Solve the system of equations from step 1 to find $\vec{x}(s)$
   - Substitute in $\vec\xi$ for $\vec{x}(0)$, and $\mu_{0}(\vec\xi)$ for $u(0)$
4. Eliminate the parameters
   - We write the parameters $\vec\xi$ introduced in step 2 in terms of the
     independent variables $\vec{x}$ and dependent variable $\mu$
5. Then we have the solution

#+begin_math-example
For the PDE

\begin{equation}
\partial_{t}\mu + e^{x}\partial_{x}\mu = 0
\end{equation}

subject to initial conditions $\mu(x, 0) = \cosh(x)$.

1. Parametrize PDE: We have $\D t/\D s = 1$, $\D x/\D s = e^{x(s)}$,
   $\D\mu/\D s = 0$
2. Parametrize initial conditions: at $s=0$ we have $t=0$, $x=\xi$,
   and $u=\cosh(\xi)$.
3. Find the characteristic curves:
   - we find $\D t/\D s=1$ integrate both sides from $s'=0$ to $s'=s$
     gives us $t=s$
   - $\D x/\D s = e^{x(s)}$ becomes $e^{-x}\D x/\D s = 1$ hence integrating
     both sides gives us $-e^{-x(s)}+e^{-x(0)}=s$. Substituting in
     the initial condition $x(0) = \xi$ and rearranging terms gives
     us $e^{-x} = e^{-\xi}-s$
   - $d\mu/ds = 0$ gives us the constant value $\mu = \cosh(\xi)$.
4. Eliminate the parameters, i.e., solve for $s$ and $\xi$ in
   terms of $x$ and $t$:
   - $s = t$
   - From $e^{-x} = e^{-\xi}-s$ and $s=t$ we have $e^{-\xi} = e^{-x}+s = e^{-x} + t$.
     Then the log of both sides $-\xi = -\xi(x,t) = \log(e^{-x} + t)$.
   - NB: the solutions to $\xi = \mbox{constant}$ give us the characteristics
5. Then we have the solution:
   - $\mu = \cosh(\xi)$ and using our solution for $\xi$ gives us
     the solution $\mu(x, t) = \cosh(\xi(x,t)) = 0.5(t + e^{-x}) + 0.5/(t + e^{-x})$.
#+end_math-example

#+begin_math-example
Consider the nonlinear wave equation $\partial_{t}\mu(x,t) + \mu(x,t)\partial_{x}\mu(x,t)=0$.
We impose initial conditions $\mu(x,0) = f(x)$.

Let $a(x,t,\mu) = 1$, $b(x,t,\mu) = \mu$, $c(x,t,\mu) = 0$.

1. Parametrize the PDE
   - We have $\D t(s)/\D s = a(x,t,\mu) = 1$,
   - $\D x(s)/\D s = b(x,t,\mu) = \mu$, and
   - $\D\mu(s)/\D s = c(x,t,\mu) = 0$.
2. Parametrize the initial conditions
   - $t(s_{0}) = 0$
   - $x(s_{0}) = \xi$
   - $\mu(s_{0}) = f(\xi)$
3. Find the characteristic curves
   - $dt/ds = 1$ implies $t = s - s_{0} = s$
   - $dx/ds = \mu$ implies $x(s) = s\mu(s) - s_{0}\mu(s_{0}) + x(s_{0})$
     or $x(s) = s\mu(s) + \xi$
   - $d\mu(s)/ds = 0$ implies $\mu(s) = \mu(s_{0}) = f(\xi)$
4. Eliminate the parameters $s$ and $\xi$
   - We find from $t = s$ that $s = t$
   - From $x(s) = s\mu(s) + \xi$ and $\mu(s) = f(\xi)$ we have the
     implicit relation $x = tf(\xi) + \xi$. In particular, this
     means that $x - t\mu = \xi$.
5. Solve for $\mu$
   - We find $\mu = f(x -  t\mu)$ is the implicit relation for the
     equation.

Observe this relation breaks down at times $t>0$ since
$\partial_{x}\mu = f'/(1 + tf')$ which fails to exist when the
denominator vanishes $1 + tf' = 0$.
#+end_math-example

** Steps involved in solving Inhomogeneous PDES

To solve

\begin{equation}
\vec{a}(\vec{x}, \mu(\vec{x}))\cdot\vec{\nabla}\mu = f(\vec{x})
\end{equation}

we enumerate the steps as follows:

1. Parametrize the PDE: $\D x^{i}(s)/\D s = a^{i}(\vec{x}(s), \mu(s))$ for $i=1,\dots,n$, and
   $\D\mu(s)/\D s = f(\vec{x}(s))$
2. Parametrize the initial conditions
   - Introduce parameters $\xi$
   - Set $s=0$
   - This gives us initial conditions for $\vec{x}(0) = \vec{\xi}$ and $\mu(0)=\mu_{0}(\vec{\xi})$.
3. Find the characteristic curves
   - Solve the system of equations from step 1 to find $\vec{x}(s)$
   - Substitute in $\vec\xi$ for $\vec{x}(0)$, and $\mu_{0}(\vec\xi)$ for $u(0)$
4. Eliminate the parameters
   - We write the parameters $\vec\xi$ introduced in step 2 in terms of the
     independent variables $\vec{x}$ and dependent variable $\mu$
5. Then we have the solution

#+begin_math-example
Consider the inhomogeneous nonlinear differential equation
$\partial_{t}\mu + \mu\partial_{x}\mu = xe^{t}$ with
$\mu(x,0)=f(x)$.

1. Parametrize the PDE
   - $\D t/\D s = 1$
   - $\D x/\D s = \mu$
   - $\D\mu/\D s = xe^{t}$
2. Parametrize the initial conditions
   - Set $t(0)=0$
   - Introduce $x(0)=\xi$
   - $\mu(0) = f(\xi)$
3. Find the characteristic curves
   - $t = s$ from the parametrized ODEs and initial condition.
   - This renders our system a coupled system of ODEs $\D x/\D s = \mu$
     and $\D\mu/\D s = xe^{s}$. This gives us $\D^{2}x/\D s^{2} = xe^{s}$.
     The solution to this involves a linear combination of modified
     Bessel functions of the second kind $K_{0}(2\sqrt{\exp(s)})$
     and modified Bessel functions of the first kind
     $I_{0}(2\sqrt{\exp(s)})$. But as $s\to0$,
     $K_{0}(2\sqrt{\exp(s)})\to K_{0}(2\sqrt{e})\approx 3.2974425$
4. Uh...wait, I don't think this is tractable anymore!

Actually, I think a change of variables is needed from $x$ to
either $\log(x)$ or $\exp(x)$. But I could be wrong.
#+end_math-example

* References

- Andrew Hogg, "Mathematical Methods". [[https://people.maths.bris.ac.uk/~maajh/methods/chap1.pdf][Ch. 1]], lecture notes.
- W. Strauss, {{{book-title(An Introduction to Partial Differential Equations)}}}.
  John Wiley and Sons, first ed., 1992.
