docs/math/pde/basics.html

<div id="outline-container-h-51cba849-fba8-458f-9e28-ac516aec3e67" class="outline-3">
<h3 id="h-51cba849-fba8-458f-9e28-ac516aec3e67"><span class="section-number-3">4.2</span> Steps involved in solving Homogeneous PDEs</h3>
<div class="outline-text-3" id="text-h-51cba849-fba8-458f-9e28-ac516aec3e67">
<p>
To solve
</p>

\begin{equation}
\vec{a}(\vec{x})\cdot\vec{\nabla}\mu = 0
\end{equation}

<p>
we enumerate the steps as follows:
</p>

<ol class="org-ol">
<li>Parametrize the PDE: \(\D x^{i}(s)/\D s = a^{i}(\vec{x}(s))\) for \(i=1,\dots,n\), and
\(\D\mu(s)/\D s = 0\)</li>
<li>Parametrize the initial conditions
<ul class="org-ul">
<li>Introduce parameters \(\xi\)</li>
<li>Set \(s=0\)</li>
<li>This gives us initial conditions for \(\vec{x}(0) = \vec{\xi}\) and \(\mu(0)=\mu_{0}(\vec{\xi})\).</li>
</ul></li>
<li>Find the characteristic curves
<ul class="org-ul">
<li>Solve the system of equations from step 1 to find \(\vec{x}(s)\)</li>
<li>Substitute in \(\vec\xi\) for \(\vec{x}(0)\), and \(\mu_{0}(\vec\xi)\) for \(u(0)\)</li>
</ul></li>
<li>Eliminate the parameters
<ul class="org-ul">
<li>We write the parameters \(\vec\xi\) introduced in step 2 in terms of the
independent variables \(\vec{x}\) and dependent variable \(\mu\)</li>
</ul></li>
<li>Then we have the solution</li>
</ol>

<div class="math-example" id="org86e24b2">
<p>
For the PDE
</p>

\begin{equation}
\partial_{t}\mu + e^{x}\partial_{x}\mu = 0
\end{equation}

<p>
subject to initial conditions \(\mu(x, 0) = \cosh(x)\).
</p>

<ol class="org-ol">
<li>Parametrize PDE: We have \(\D t/\D s = 1\), \(\D x/\D s = e^{x(s)}\),
\(\D\mu/\D s = 0\)</li>
<li>Parametrize initial conditions: at \(s=0\) we have \(t=0\), \(x=\xi\),
and \(u=\cosh(\xi)\).</li>
<li>Find the characteristic curves:
<ul class="org-ul">
<li>we find \(\D t/\D s=1\) integrate both sides from \(s'=0\) to \(s'=s\)
gives us \(t=s\)</li>
<li>\(\D x/\D s = e^{x(s)}\) becomes \(e^{-x}\D x/\D s = 1\) hence integrating
both sides gives us \(-e^{-x(s)}+e^{-x(0)}=s\). Substituting in
the initial condition \(x(0) = \xi\) and rearranging terms gives
us \(e^{-x} = e^{-\xi}-s\)</li>
<li>\(d\mu/ds = 0\) gives us the constant value \(\mu = \cosh(\xi)\).</li>
</ul></li>
<li>Eliminate the parameters, i.e., solve for \(s\) and \(\xi\) in
terms of \(x\) and \(t\):
<ul class="org-ul">
<li>\(s = t\)</li>
<li>From \(e^{-x} = e^{-\xi}-s\) and \(s=t\) we have \(e^{-\xi} = e^{-x}+s = e^{-x} + t\).
Then the log of both sides \(-\xi = -\xi(x,t) = \log(e^{-x} + t)\).</li>
<li>NB: the solutions to \(\xi = \mbox{constant}\) give us the characteristics</li>
</ul></li>
<li>Then we have the solution:
<ul class="org-ul">
<li>\(\mu = \cosh(\xi)\) and using our solution for \(\xi\) gives us
the solution \(\mu(x, t) = \cosh(\xi(x,t)) = 0.5(t + e^{-x}) + 0.5/(t + e^{-x})\).</li>
</ul></li>
</ol>

</div>

<div class="math-example" id="orge0600c7">
<p>
Consider the nonlinear wave equation \(\partial_{t}\mu(x,t) + \mu(x,t)\partial_{x}\mu(x,t)=0\).
We impose initial conditions \(\mu(x,0) = f(x)\).
</p>

<p>
Let \(a(x,t,\mu) = 1\), \(b(x,t,\mu) = \mu\), \(c(x,t,\mu) = 0\).
</p>

<ol class="org-ol">
<li>Parametrize the PDE
<ul class="org-ul">
<li>We have \(\D t(s)/\D s = a(x,t,\mu) = 1\),</li>
<li>\(\D x(s)/\D s = b(x,t,\mu) = \mu\), and</li>
<li>\(\D\mu(s)/\D s = c(x,t,\mu) = 0\).</li>
</ul></li>
<li>Parametrize the initial conditions
<ul class="org-ul">
<li>\(t(s_{0}) = 0\)</li>
<li>\(x(s_{0}) = \xi\)</li>
<li>\(\mu(s_{0}) = f(\xi)\)</li>
</ul></li>
<li>Find the characteristic curves
<ul class="org-ul">
<li>\(dt/ds = 1\) implies \(t = s - s_{0} = s\)</li>
<li>\(dx/ds = \mu\) implies \(x(s) = s\mu(s) - s_{0}\mu(s_{0}) + x(s_{0})\)
or \(x(s) = s\mu(s) + \xi\)</li>
<li>\(d\mu(s)/ds = 0\) implies \(\mu(s) = \mu(s_{0}) = f(\xi)\)</li>
</ul></li>
<li>Eliminate the parameters \(s\) and \(\xi\)
<ul class="org-ul">
<li>We find from \(t = s\) that \(s = t\)</li>
<li>From \(x(s) = s\mu(s) + \xi\) and \(\mu(s) = f(\xi)\) we have the
implicit relation \(x = tf(\xi) + \xi\). In particular, this
means that \(x - t\mu = \xi\).</li>
</ul></li>
<li>Solve for \(\mu\)
<ul class="org-ul">
<li>We find \(\mu = f(x -  t\mu)\) is the implicit relation for the
equation.</li>
</ul></li>
</ol>

<p>
Observe this relation breaks down at times \(t>0\) since
\(\partial_{x}\mu = f'/(1 + tf')\) which fails to exist when the
denominator vanishes \(1 + tf' = 0\).
</p>

</div>
</div>
</div>

<div id="outline-container-h-8b648e77-9e8b-4fe5-a4ca-96f145812801" class="outline-3">
<h3 id="h-8b648e77-9e8b-4fe5-a4ca-96f145812801"><span class="section-number-3">4.3</span> Steps involved in solving Inhomogeneous PDES</h3>
<div class="outline-text-3" id="text-h-8b648e77-9e8b-4fe5-a4ca-96f145812801">
<p>
To solve
</p>

\begin{equation}
\vec{a}(\vec{x}, \mu(\vec{x}))\cdot\vec{\nabla}\mu = f(\vec{x})
\end{equation}

<p>
we enumerate the steps as follows:
</p>

<ol class="org-ol">
<li>Parametrize the PDE: \(\D x^{i}(s)/\D s = a^{i}(\vec{x}(s), \mu(s))\) for \(i=1,\dots,n\), and
\(\D\mu(s)/\D s = f(\vec{x}(s))\)</li>
<li>Parametrize the initial conditions
<ul class="org-ul">
<li>Introduce parameters \(\xi\)</li>
<li>Set \(s=0\)</li>
<li>This gives us initial conditions for \(\vec{x}(0) = \vec{\xi}\) and \(\mu(0)=\mu_{0}(\vec{\xi})\).</li>
</ul></li>
<li>Find the characteristic curves
<ul class="org-ul">
<li>Solve the system of equations from step 1 to find \(\vec{x}(s)\)</li>
<li>Substitute in \(\vec\xi\) for \(\vec{x}(0)\), and \(\mu_{0}(\vec\xi)\) for \(u(0)\)</li>
</ul></li>
<li>Eliminate the parameters
<ul class="org-ul">
<li>We write the parameters \(\vec\xi\) introduced in step 2 in terms of the
independent variables \(\vec{x}\) and dependent variable \(\mu\)</li>
</ul></li>
<li>Then we have the solution</li>
</ol>

<div class="math-example" id="org99ef56b">
<p>
Consider the inhomogeneous nonlinear differential equation
\(\partial_{t}\mu + \mu\partial_{x}\mu = xe^{t}\) with
\(\mu(x,0)=f(x)\).
</p>

<ol class="org-ol">
<li>Parametrize the PDE
<ul class="org-ul">
<li>\(\D t/\D s = 1\)</li>
<li>\(\D x/\D s = \mu\)</li>
<li>\(\D\mu/\D s = xe^{t}\)</li>
</ul></li>
<li>Parametrize the initial conditions
<ul class="org-ul">
<li>Set \(t(0)=0\)</li>
<li>Introduce \(x(0)=\xi\)</li>
<li>\(\mu(0) = f(\xi)\)</li>
</ul></li>
<li>Find the characteristic curves
<ul class="org-ul">
<li>\(t = s\) from the parametrized ODEs and initial condition.</li>
<li>This renders our system a coupled system of ODEs \(\D x/\D s = \mu\)
and \(\D\mu/\D s = xe^{s}\). This gives us \(\D^{2}x/\D s^{2} = xe^{s}\).
The solution to this involves a linear combination of modified
Bessel functions of the second kind \(K_{0}(2\sqrt{\exp(s)})\)
and modified Bessel functions of the first kind
\(I_{0}(2\sqrt{\exp(s)})\). But as \(s\to0\),
\(K_{0}(2\sqrt{\exp(s)})\to K_{0}(2\sqrt{e})\approx 3.2974425\)</li>
</ul></li>
<li>Uh&#x2026;wait, I don't think this is tractable anymore!</li>
</ol>

<p>
Actually, I think a change of variables is needed from \(x\) to
either \(\log(x)\) or \(\exp(x)\). But I could be wrong.
</p>

</div>
</div>
</div>
</div>

<div id="outline-container-h-43de617f-65f8-4f9d-b91d-6418e0ce8180" class="outline-2">
<h2 id="h-43de617f-65f8-4f9d-b91d-6418e0ce8180"><span class="section-number-2">5</span> References</h2>
<div class="outline-text-2" id="text-h-43de617f-65f8-4f9d-b91d-6418e0ce8180">
<ul class="org-ul">
<li>Andrew Hogg, "Mathematical Methods". <a href="https://people.maths.bris.ac.uk/~maajh/methods/chap1.pdf">Ch. 1</a>, lecture notes.</li>
<li>W. Strauss, <cite class="book-title">An Introduction to Partial Differential Equations</cite>.
John Wiley and Sons, first ed., 1992.</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="postamble">Last Updated 2021-04-11 Sun 11:59.</p>
</div>
</body>
</html>